cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'git'
brew 'git-extras'
brew 'htop-osx'
brew 'imagemagick', args: ['with-webp']
brew 'mercurial'
brew 'mongodb'
brew 'mysql'
brew 'openssl'
brew 'pcre'
brew 'phantomjs'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-override-system-vi']
brew 'wget', args: ['with-iri']

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'php56', args: ['with-mysql', 'with-fpm', 'with-homebrew-openssl']

cask 'appcleaner'
cask 'atom'
cask 'clamxav'
cask 'colorschemer-studio'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome-canary'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'keepassx'
cask 'onyx'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'virtualbox'
cask 'vlc'
